In [2]:
# Mechine Learning :
# DATA : Devided into two parts ....(1) Independent (x) , (2) Dependent (y).
# (x)...> x_train , x_test
# (y)....> y_train , y_test

# IN TRAINING ...> we will trained our model from input to  target data relation.
# IN TESTING....> we will check our model that our model is perfectly working or not.

In [24]:
import numpy as np
import pandas as pd

In [26]:
df1 = pd.read_csv('placement - placement.csv')
df1

    cgpa  resume_score  placed
0   8.14          6.52       1
1   6.17          5.17       0
2   8.27          8.86       1
3   6.88          7.27       1
4   7.52          7.30       1
..   ...           ...     ...
95  6.33          6.38       0
96  8.23          7.76       1
97  6.65          7.78       0
98  8.14          5.63       1
99  6.09          6.61       0

[100 rows x 3 columns]

In [28]:
df1.head()

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0
2  8.27          8.86       1
3  6.88          7.27       1
4  7.52          7.30       1

In [30]:
df1.shape

(100, 3)

In [32]:
x = df1.drop(columns = ['placed'])   # input data
y = df1['placed']   # target data

In [35]:
!pip install scikit-learn

Requirement already satisfied: scikit-learn in c:\programdata\anaconda3\lib\site-packages (1.5.1)
Requirement already satisfied: numpy>=1.19.5 in c:\programdata\anaconda3\lib\site-packages (from scikit-learn) (1.26.4)
Requirement already satisfied: scipy>=1.6.0 in c:\programdata\anaconda3\lib\site-packages (from scikit-learn) (1.13.1)
Requirement already satisfied: joblib>=1.2.0 in c:\programdata\anaconda3\lib\site-packages (from scikit-learn) (1.4.2)
Requirement already satisfied: threadpoolctl>=3.1.0 in c:\programdata\anaconda3\lib\site-packages (from scikit-learn) (3.5.0)

In [36]:
from sklearn.model_selection import train_test_split

In [37]:
x_train , x_test , y_train , y_test = train_test_split(x,y,test_size=0.2,random_state=42)

In [42]:
x_train

    cgpa  resume_score
55  6.94          6.87
88  8.07          6.07
26  6.27          6.47
42  6.90          6.91
69  8.06          9.06
..   ...           ...
60  5.87          6.64
71  7.34          8.22
14  7.51          6.25
92  5.43          6.18
51  6.54          7.39

[80 rows x 2 columns]

In [44]:
x_test

    cgpa  resume_score
83  7.60          8.08
53  6.00          7.16
70  7.12          7.41
45  8.10          5.44
44  5.47          5.92
39  7.50          6.19
22  6.16          5.77
80  7.83          7.70
10  6.18          6.35
0   8.14          6.52
18  5.94          5.88
30  7.36          7.15
73  5.76          6.48
33  8.43          7.73
90  5.85          5.56
4   7.52          7.30
76  9.40          5.50
77  5.88          6.92
12  6.09          7.01
31  5.92          7.02

In [46]:
y_train

55    1
88    1
26    0
42    1
69    1
     ..
60    0
71    1
14    1
92    0
51    0
Name: placed, Length: 80, dtype: int64

In [48]:
y_test

83    1
53    0
70    1
45    1
44    0
39    1
22    0
80    1
10    0
0     1
18    0
30    1
73    0
33    1
90    0
4     1
76    1
77    0
12    0
31    0
Name: placed, dtype: int64

In [54]:
print("Total data shape:",df1.shape)
print("Input data shape:", x.shape)
print("Input data shape:", x_train.shape)
print("Input data shape:", x_test.shape)
print("------------------------------------------")
print("Input data shape:", y.shape)
print("Input data shape:", y_train.shape)
print("Input data shape:", y_test.shape)

Total data shape: (100, 3)
Input data shape: (100, 2)
Input data shape: (80, 2)
Input data shape: (20, 2)
------------------------------------------
Input data shape: (100,)
Input data shape: (80,)
Input data shape: (20,)

In [56]:
# covid data

In [64]:
df = pd.read_csv('covid_toy - covid_toy.csv')
df.head(3)

   age gender  fever cough     city has_covid
0   60   Male  103.0  Mild  Kolkata        No
1   27   Male  100.0  Mild    Delhi       Yes
2   42   Male  101.0  Mild    Delhi        No

In [66]:
df['gender'].value_counts()

gender
Female    59
Male      41
Name: count, dtype: int64

In [68]:
df['cough'].value_counts()

cough
Mild      62
Strong    38
Name: count, dtype: int64

In [70]:
df['city'].value_counts()

city
Kolkata      32
Bangalore    30
Delhi        22
Mumbai       16
Name: count, dtype: int64

In [80]:
df['has_covid'].value_counts()

has_covid
No     55
Yes    45
Name: count, dtype: int64

In [82]:
df['gender'] = df['gender'].map({"Female":0, "Male":1})

In [86]:
df['cough']=df['cough'].map({"Mild":0, "Strong":1})

In [90]:
df.sample(4)

    age  gender  fever  cough       city has_covid
41   82     NaN    NaN      0    Kolkata       Yes
78   11     NaN  100.0      0  Bangalore       Yes
36   38     NaN  101.0      0  Bangalore        No
88    5     NaN  100.0      0    Kolkata        No

In [96]:
x=df.drop(columns=["has_covid"])
y=df['has_covid']

In [98]:
print("Total data shape:",df1.shape)
print("Input data shape:", x.shape)
print("Input data shape:", x_train.shape)
print("Input data shape:", x_test.shape)
print("------------------------------------------")
print("Input data shape:", y.shape)
print("Input data shape:", y_train.shape)
print("Input data shape:", y_test.shape)

Total data shape: (100, 3)
Input data shape: (100, 5)
Input data shape: (80, 2)
Input data shape: (20, 2)
------------------------------------------
Input data shape: (100,)
Input data shape: (80,)
Input data shape: (20,)